Revit 2026 API

# RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType) Constructor

---

Create a non-spiral shape definition.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarShapeDefinitionByArc(
	Document doc,
	RebarShapeDefinitionByArcType type
)
```
```vb
Public Sub New (
	doc As Document,
	type As RebarShapeDefinitionByArcType
)
```
```cpp
public:
RebarShapeDefinitionByArc(
	Document^ doc,
	RebarShapeDefinitionByArcType type
)
```
```fsharp
new :
        doc : Document *
        type : RebarShapeDefinitionByArcType -> RebarShapeDefinitionByArc
```

#### Parameters

doc Document

type RebarShapeDefinitionByArcType

| Exception | Condition |
| --- | --- |
| ArgumentException | The arc type cannot be set directly to Spiral. Instead, call SetArcTypeSpiral() to provide defaults for spiral parameters. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Replaces RebarShape.NewDefinitionByArc() from prior versions.

#### Reference

RebarShapeDefinitionByArc Class

RebarShapeDefinitionByArc Overload

Autodesk.Revit.DB.Structure Namespace